[
	{
		"version": "1.4.0",
		"date": "2025-12-18",
		"changes": [
			"Upgrade to Next.js 16 for improved performance and features.",
			"Added a documentation page and MDX-based doc system for better content management.",
			"Implemented API key support and updated authentication handling.",
			"Added OpenAPI documentation for backend routes and a new JSON endpoint to expose API docs.",
			"Updated QR code style schema with full color and gradient support.",
			"Added CLEK webhook endpoint and event handling; moved logic from middleware to frontend proxy.",
			"Refactored backend code and updated tests for new features.",
			"Various formatting and configuration updates."
		]
	},
	{
		"version": "1.3.0",
		"date": "2025-12-06",
		"changes": [
			"Users can now view and edit their templates directly in the collection.",
			"Bug fixes related to the QR code edit feature."
		]
	},
	{
		"version": "1.2.0",
		"date": "2025-12-05",
		"changes": [
			"Added a Changelog view so you can see the latest updates directly in the app.",
			"Users can now edit QR codes and view new detailed edit pages for all QR code types.",
			"Removed collection-based detail pages: now only dynamic QR codes can be viewed in detail, other types can only be edited.",
			"Updated translations for improved multilingual support.",
			"Improved responsive design and usability on mobile devices.",
			"Various bug fixes and performance improvements."
		]
	},
	{
		"version": "1.1.4",
		"date": "2025-10-06",
		"changes": [
			"Added URL shortener support for cleaner and shorter QR code links.",
			"Improved multilingual support and updated translations.",
			"Added collection pagination for better navigation of saved QR codes.",
			"Optimized SEO with improved meta data, hreflang tags, and a new FAQ module.",
			"Added sitemap.xml and robots.txt for better search engine indexing.",
			"Improved mobile navigation and fixed several hydration issues.",
			"Introduced support for RGBA colors in QR code customization.",
			"General performance improvements, UI fixes, and dependency updates."
		]
	},
	{
		"version": "1.1.3",
		"date": "2025-07-4",
		"changes": [
			"Add support for rgba colors & transparent backgrounds",
			"Fix various bugs and UI issues"
		]
	}
]
